patterns = {
    'ch': {
        'fill': ['也被称为<span>。', '的别名是<span>。', '的缩写为<span>。', ',简称<span>。', '也作为<span>被熟知。'],
        'generate':
            {
                'prefix': ['也被称为', '的别名是', '又名', '即', '的全名是', '简称'],  # List of templates
                'suffix': ['也被称为', '的别名是', '的缩写为', ',简称'],
                'abbreviation': ['也被称为', '的别名是', '的缩写为', ',简称'],
                # 'synonym': ['也被称为', '的别名是', '的同义词是', ',也称'],
                'synonym': ['也被称为', '的别名是', '的同义词是', '，也称', '，又叫', '，即'],
                'punctuation': ['也被称为', '的别名是', ',简称', '，简称', '简称'],
                'bilingual': ['也被称为', '的别名是', '的译文是', ',也称'],
                'multiple': ['也被称为', '的别名是', '的缩写为', ',也称'],
            }
    }

}
few_shot_alias_table = {
    'prefix': {
        '标致408': ['东风标致408'], '东风标致408': ['标致408'],
    },
    'suffix': {
        '杏仁桉': ['杏仁桉树'], '杏仁桉树': ['杏仁桉'],
    },
    'abbreviation': {
        '北京航空航天大学体育馆': ['北航体育馆'], '北航体育馆': ['北京航空航天大学体育馆'],
        '津巴布韦元': ['津元'], '津元': ['津巴布韦元'],
        '湖南省道县第二中学': ['道县二中'], '道县二中': ['湖南省道县第二中学'],
        '含盐量测定计': ['盐度计'], '盐度计': ['含盐量测定计'],
        '中国中药博览会': ['药博会'], '药博会': ['中国中药博览会'],
        '马来西亚石油公司': ['马石油'], '马石油': ['马来西亚石油公司'],
        '中国人民解放军江苏省军区': ['江苏军区'], '江苏军区': ['中国人民解放军江苏省军区'],
        '铁路钢轨': ['路轨'], '路轨': ['铁路钢轨'],
        '中国移动通信集团四川有限公司': ['四川移动'], '四川移动': ['中国移动通信集团四川有限公司'],
        '复方白屈菜酊': ['止痛酊'], '止痛酊': ['复方白屈菜酊'],
    },
    'synonym': {
        '山西省工艺美术协会': ['山西工艺美术协会'], '山西工艺美术协会': ['山西省工艺美术协会'],
        '应城火车站': ['应城站'], '应城站': ['应城火车站'],
        '云南警察总局': ['云南省会警察厅'], '云南省会警察厅': ['云南警察总局'],
        '铜陵三中': ['铜陵市第三中学'], '铜陵市第三中学': ['铜陵三中'],
        '无义务原则': ['无干预原则'], '无干预原则': ['无义务原则'],
        '国际业余拳击协会': ['国际业余拳击联合会'], '国际业余拳击联合会': ['国际业余拳击协会'],
        '蓝团鱼': ['绿团鱼'], '绿团鱼': ['蓝团鱼'],
        '喉部肿瘤': ['喉肿瘤'], '喉肿瘤': ['喉部肿瘤'],
        'α-干扰素': ['α干扰素'], 'α干扰素': ['α-干扰素'],
        '米底人': ['米堤亚人'], '米堤亚人': ['米底人'],
    },
    'punctuation': {
        '《燕北录》': ['燕北录'], '燕北录': ['《燕北录》'],
    },
    'multiple': {
        '夏延族': ['夏延人', '夏安族'], '夏延人': ['夏延族', '夏安族'], '夏安族': ['夏延族', '夏延人'],
    },
    'void': {},
}
